In [1]:
import sqlite3

In [2]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [3]:
connection = sqlite3.connect('my_database2.db')

In [4]:
%load_ext sql
%sql sqlite:///my_database2.db

In [5]:
%sql DROP TABLE IF EXISTS Employee;
%sql DROP TABLE IF EXISTS Provider;
%sql DROP TABLE IF EXISTS Store;
%sql DROP TABLE IF EXISTS Deal;
%sql DROP TABLE IF EXISTS Client;
%sql DROP TABLE IF EXISTS Product;

 * sqlite:///my_database2.db
Done.
 * sqlite:///my_database2.db
Done.
 * sqlite:///my_database2.db
Done.
 * sqlite:///my_database2.db
Done.
 * sqlite:///my_database2.db
Done.
 * sqlite:///my_database2.db
Done.

[]

In [6]:
%%sql
CREATE TABLE IF NOT EXISTS Product (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    unit TEXT NOT NULL,
    description TEXT NOT NULL,
    category TEXT NOT NULL
)

 * sqlite:///my_database2.db
Done.

[]

In [7]:
%%sql
CREATE TABLE IF NOT EXISTS Provider (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
)

 * sqlite:///my_database2.db
Done.

[]

In [8]:
%%sql 
CREATE TABLE IF NOT EXISTS Employee (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    ID_Manager INTEGER,
    FOREIGN KEY (ID_Manager) REFERENCES Employee(id)
)

 * sqlite:///my_database2.db
Done.

[]

In [9]:
%%sql
CREATE TABLE IF NOT EXISTS Store (
    id INTEGER PRIMARY KEY,
    ID_Provider INTEGER NOT NULL,
    ID_Product INTEGER NOT NULL,
    quantity INTEGER NOT NULL,
    price DECIMAL NOT NULL,
    date DATE NOT NULL,
    FOREIGN KEY (ID_Provider) REFERENCES Provider(id),
    FOREIGN KEY (ID_Product) REFERENCES Product(id)
)

 * sqlite:///my_database2.db
Done.

[]

In [10]:
%%sql
CREATE TABLE IF NOT EXISTS Client (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    phone INTEGER NOT NULL,
    adress TEXT NOT NULL,
    sex VARCHAR(1) NOT NULL
)

 * sqlite:///my_database2.db
Done.

[]

In [11]:
%%sql
CREATE TABLE IF NOT EXISTS Deal (
    id INTEGER PRIMARY KEY,
    date DATE NOT NULL,
    ID_Store INTEGER NOT NULL,
    ID_Client INTEGER NOT NULL,
    ID_Employee INTEGER NOT NULL,
    quantity INTEGER NOT NULL,
    discount INTEGER NOT NULL,
    FOREIGN KEY (ID_Store) REFERENCES Store(id),
    FOREIGN KEY (ID_Client) REFERENCES Client(id),
    FOREIGN KEY (ID_Employee) REFERENCES Employee(id)
)

 * sqlite:///my_database2.db
Done.

[]

In [12]:
%%sql
INSERT INTO Provider (name) VALUES
('Компания A'), 
('Компания B'),
('Компания C'), 
('ИП Иванов И.И.'), 
('ИП Петров П.П.');

 * sqlite:///my_database2.db
5 rows affected.

[]

In [13]:
%%sql
INSERT INTO Product ( name, unit, description, category) VALUES
('Футбольный мяч', 'шт', 'Прочный мяч для футбола', 'Спортивные товары'),
('Ноутбук', 'шт', 'Мощный ноутбук для работы и развлечений', 'Электроника'),
( 'Зонтик', 'шт', 'Компактный складной зонт для дождливой погоды', 'Аксессуары'),
('Фотоаппарат', 'шт', 'Профессиональная камера для фотосъемки', 'Фототехника'),
( 'Сумка', 'шт', 'Стильная сумка для повседневного использования', 'Мода'),
( 'Наушники', 'шт', 'Беспроводные наушники с отличным звуком', 'Электроника'),
('Книга', 'шт', 'Увлекательная книга для чтения в свободное время', 'Книги'),
('Кофеварка', 'шт', 'Кофеварка для приготовления ароматного кофе', 'Кухонная утварь'),
( 'Джинсы', 'шт', 'Стильные джинсы с высоким качеством материалов', 'Мода'),
( 'Чехол для смартфона', 'шт', 'Защитный чехол для смартфона с креативным дизайном', 'Аксессуары');

 * sqlite:///my_database2.db
10 rows affected.

[]

In [14]:
%%sql
INSERT INTO Employee (ID_Manager, name) VALUES
(NULL, 'Иванов Павел'),
(1, 'Петров Алексей'),
(1, 'Сидорова Елена'),
(2, 'Козлова Анастасия'),
(2, 'Смирнов Дмитрий'),
(2, 'Попова Ольга'),
(3, 'Николаев Игорь'),
(3, 'Сергеева Марина'),
(3, 'Петров Денис');

 * sqlite:///my_database2.db
9 rows affected.

[]

In [15]:
%%sql
INSERT INTO Store (ID_Provider, ID_Product, quantity, price, date) VALUES
(1, 1, 100, 50.00, '2025-01-10'), -- Product 1 поставлен Company A по цене 50.00
(2, 1, 150, 55.00, '2025-02-15'), -- Product 1 поставлен Company B по цене 55.00
(1, 2, 50, 800.00, '2025-01-05'), -- Product 2 поставлен Company A по цене 800.00
(3, 2, 70, 750.00, '2025-03-20'), -- Product 2 поставлен Company C по цене 750.00
(2, 3, 200, 15.00, '2025-01-20'), -- Product 3 поставлен Company B по цене 15.00
(3, 4, 30, 1200.00, '2025-01-30'), -- Product 4 поставлен Company C по цене 1200.00
(1, 4, 40, 1250.00, '2025-02-10'), -- Product 4 поставлен Company A по цене 1250.00
(1, 4, 200, 1350.00, '2025-02-10'), -- Product 4 поставлен Company A по цене 1250.00
(1, 5, 0, 50.00, '2025-03-05'), -- Product 5 закончился на складе у Company A
(2, 6, 100, 100.00, '2025-02-28'), -- Product 6 поставлен Company B по цене 100.00
(2, 7, 150, 10.00, '2025-01-15') -- Product 7 поставлен Company B по цене 10.00

 * sqlite:///my_database2.db
11 rows affected.

[]

In [16]:
%%sql
INSERT INTO Client (name, phone, adress, sex) VALUES
('Иванов Петр', 79123456789, 'ул. Центральная, д. 5, кв. 3', 'м'),
('Смирнова Елена', 79231234567, 'пер. Лесной, д. 10, кв. 15', 'ж'),
('Козлов Александр', 79011223344, 'пр-т Парковый, д. 8, кв. 2', 'м'),
('Попова Марина', 79998887766, 'ул. Солнечная, д. 3, кв. 7', 'ж'),
('Николаев Андрей', 79777770010, 'пр-т Победы, д. 15, кв. 1', 'м'),
('Сергеева Ольга', 79888882233, 'ул. Главная, д. 20, кв. 4', 'ж'),
('Петров Дмитрий', 79665554488, 'пер. Цветочный, д. 7, кв. 10', 'м'),
('Кузнецова Анна', 79050005500, 'пр-т Ленина, д. 12, кв. 6', 'ж'),
('Жуков Игорь', 79991112233, 'ул. Первомайская, д. 1, кв. 9', 'м'),
('Морозова Наталья', 79887776655, 'пер. Луговой, д. 25, кв. 12', 'ж');

 * sqlite:///my_database2.db
10 rows affected.

[]

In [17]:
%%sql
INSERT INTO Deal (date, ID_Store, ID_Client, ID_Employee, quantity, discount) VALUES
('2025-02-05', 1, 1, 1, 5, 10), -- Сделка 1
('2025-01-06', 2, 2, 1, 10, 15), -- Сделка 2
('2025-01-07', 1, 3, 2, 3, 5), -- Сделка 3
('2025-01-08', 3, 4, 3, 8, 12), -- Сделка 4
('2025-01-09', 2, 5, 3, 6, 8), -- Сделка 5
('2025-01-15', 3, 6, 1, 4, 10), -- Сделка 6
('2025-01-20', 1, 7, 3, 7, 15), -- Сделка 7
('2025-01-25', 2, 8, 1, 7, 10), -- Сделка 8
('2025-01-26', 3, 10, 2, 9, 20), -- Сделка 9
('2025-01-28', 1, 10, 2, 11, 25); -- Сделка 10

 * sqlite:///my_database2.db
10 rows affected.

[]

In [18]:
%sql SELECT * FROM Product

 * sqlite:///my_database2.db
Done.

[(1, 'Футбольный мяч', 'шт', 'Прочный мяч для футбола', 'Спортивные товары'),
 (2, 'Ноутбук', 'шт', 'Мощный ноутбук для работы и развлечений', 'Электроника'),
 (3, 'Зонтик', 'шт', 'Компактный складной зонт для дождливой погоды', 'Аксессуары'),
 (4, 'Фотоаппарат', 'шт', 'Профессиональная камера для фотосъемки', 'Фототехника'),
 (5, 'Сумка', 'шт', 'Стильная сумка для повседневного использования', 'Мода'),
 (6, 'Наушники', 'шт', 'Беспроводные наушники с отличным звуком', 'Электроника'),
 (7, 'Книга', 'шт', 'Увлекательная книга для чтения в свободное время', 'Книги'),
 (8, 'Кофеварка', 'шт', 'Кофеварка для приготовления ароматного кофе', 'Кухонная утварь'),
 (9, 'Джинсы', 'шт', 'Стильные джинсы с высоким качеством материалов', 'Мода'),
 (10, 'Чехол для смартфона', 'шт', 'Защитный чехол для смартфона с креативным дизайном', 'Аксессуары')]

In [19]:
%sql SELECT * FROM Provider

 * sqlite:///my_database2.db
Done.

[(1, 'Компания A'),
 (2, 'Компания B'),
 (3, 'Компания C'),
 (4, 'ИП Иванов И.И.'),
 (5, 'ИП Петров П.П.')]

In [20]:
%sql SELECT * FROM Employee

 * sqlite:///my_database2.db
Done.

[(1, 'Иванов Павел', None),
 (2, 'Петров Алексей', 1),
 (3, 'Сидорова Елена', 1),
 (4, 'Козлова Анастасия', 2),
 (5, 'Смирнов Дмитрий', 2),
 (6, 'Попова Ольга', 2),
 (7, 'Николаев Игорь', 3),
 (8, 'Сергеева Марина', 3),
 (9, 'Петров Денис', 3)]

In [21]:
%sql SELECT * FROM Store

 * sqlite:///my_database2.db
Done.

[(1, 1, 1, 100, 50, '2025-01-10'),
 (2, 2, 1, 150, 55, '2025-02-15'),
 (3, 1, 2, 50, 800, '2025-01-05'),
 (4, 3, 2, 70, 750, '2025-03-20'),
 (5, 2, 3, 200, 15, '2025-01-20'),
 (6, 3, 4, 30, 1200, '2025-01-30'),
 (7, 1, 4, 40, 1250, '2025-02-10'),
 (8, 1, 4, 200, 1350, '2025-02-10'),
 (9, 1, 5, 0, 50, '2025-03-05'),
 (10, 2, 6, 100, 100, '2025-02-28'),
 (11, 2, 7, 150, 10, '2025-01-15')]

In [22]:
%sql SELECT * FROM Client

 * sqlite:///my_database2.db
Done.

[(1, 'Иванов Петр', 79123456789, 'ул. Центральная, д. 5, кв. 3', 'м'),
 (2, 'Смирнова Елена', 79231234567, 'пер. Лесной, д. 10, кв. 15', 'ж'),
 (3, 'Козлов Александр', 79011223344, 'пр-т Парковый, д. 8, кв. 2', 'м'),
 (4, 'Попова Марина', 79998887766, 'ул. Солнечная, д. 3, кв. 7', 'ж'),
 (5, 'Николаев Андрей', 79777770010, 'пр-т Победы, д. 15, кв. 1', 'м'),
 (6, 'Сергеева Ольга', 79888882233, 'ул. Главная, д. 20, кв. 4', 'ж'),
 (7, 'Петров Дмитрий', 79665554488, 'пер. Цветочный, д. 7, кв. 10', 'м'),
 (8, 'Кузнецова Анна', 79050005500, 'пр-т Ленина, д. 12, кв. 6', 'ж'),
 (9, 'Жуков Игорь', 79991112233, 'ул. Первомайская, д. 1, кв. 9', 'м'),
 (10, 'Морозова Наталья', 79887776655, 'пер. Луговой, д. 25, кв. 12', 'ж')]

In [23]:
%sql SELECT * FROM Deal

 * sqlite:///my_database2.db
Done.

[(1, '2025-02-05', 1, 1, 1, 5, 10),
 (2, '2025-01-06', 2, 2, 1, 10, 15),
 (3, '2025-01-07', 1, 3, 2, 3, 5),
 (4, '2025-01-08', 3, 4, 3, 8, 12),
 (5, '2025-01-09', 2, 5, 3, 6, 8),
 (6, '2025-01-15', 3, 6, 1, 4, 10),
 (7, '2025-01-20', 1, 7, 3, 7, 15),
 (8, '2025-01-25', 2, 8, 1, 7, 10),
 (9, '2025-01-26', 3, 10, 2, 9, 20),
 (10, '2025-01-28', 1, 10, 2, 11, 25)]